{
  "vegetarian": false,
  "vegan": false,
  "glutenFree": false,
  "dairyFree": true,
  "veryHealthy": false,
  "cheap": false,
  "veryPopular": false,
  "sustainable": false,
  "ketogenic": false,
  "whole30": false,
  "preparationMinutes": 10,
  "cookingMinutes": 10,
  "sourceUrl": "http://feedmephoebe.com/2013/11/job-food52s-pan-roasted-cauliflower/",
  "sourceName": "Feed Me Phoebe",
  "extendedIngredients": [
    {
      "id": 18079,
      "name": "breadcrumbs",
      "amount": 0.5,
      "unit": "cup"
    },
    {
      "id": 11135,
      "name": "cauliflower",
      "amount": 1,
      "unit": "head"
    }
  ],
  "id": 479101,
  "title": "On the Job: Pan Roasted Cauliflower From Food52",
  "readyInMinutes": 20,
  "servings": 4,
  "image": "https://spoonacular.com/recipeImages/479101-556x370.jpg",
  "analyzedInstructions": [
    {
      "steps": [
        {
          "number": 1,
          "step": "Cut the florets off the stems and and then chop them into tiny florets. You can also chop up the stems into tiny pieces if you want. You should have about 6 cups of chopped cauliflower. In a large skillet heat 2 tablespoons of olive oil over medium-high heat."
        },
        {
          "number": 2,
          "step": "Add the cauliflower, 1 teaspoon of salt, rosemary, and sumac. Sauté until cauliflower is tender and starts to brown a bit, stirring as necessary, about 15 minutes. You can also add a bit of olive oil if the pan starts to get too dry or the cauliflower is starting to stick. Meanwhile, in a small skillet, toast the pinenuts over medium heat until golden brown. Set aside."
        },
        {
          "number": 3,
          "step": "Heat the remaining 2 tablespoons of olive oil in the same pan. Once oil is shimmering, toss in the breadcrumbs and stir, toasting the breadcrumbs. Season with a pinch of kosher salt and a few turns of freshly ground black pepper."
        },
        {
          "number": 4,
          "step": "Remove from the heat and toss in half of the chopped parsley. When cauliflower is done, remove from the heat and season to taste with freshly ground black pepper and a pinch or so of salt if necessary. Toss in the toasted pine nuts, the chopped raisins, and the remaining parsley. When ready to serve, sprinkle the top with the toasted breadcrumbs and some pecorino."
        }
      ]
    }
  ]
}